data_generation/simulation_results/openfoam/case_2/constant/simParams
nIter 2000;
hComponent0 974.2141409075829;
hComponent1 617.417138480414;
hComponent2 1400.6567342534595;
hComponent3 918.8046300352106;
hComponent4 956.0870963466903;kComponent0 85.05072885005455;
kComponent1 45.86091073766184;
kComponent2 49.97300263437709;
kComponent3 81.17449768111057;
kComponent4 46.26834535887046;
tAmbient 300;
Ux 1.1372998674512458;
kPCB 0.7218391806082146;